# Used by the brew_install() function.

# CLIs
brew "ffmpeg"
brew "gh"
brew "git"
brew "jq"
brew "imagemagick"
brew "mas" # required to install Mac App Store apps below
brew "node"
brew "pngquant"
brew "pnpm"
brew "python"
brew "rename"
brew "rsync"
brew "shellcheck"
brew "trash"
brew "zopfli"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Apps
cask "1password"
cask "appcleaner"
cask "brave-browser"
cask "coconutbattery"
cask "daisydisk"
cask "handbrake"
cask "imageoptim"
cask "maccy"
cask "mylio"
cask "nordvpn"
cask "rectangle"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "ghostty"
cask "zoom"
cask "zotero"

# Mac App Store
mas "Affinity Designer", id: 824171161
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "MoneyMoney", id: 872698314
mas "Yoink", id: 457622435
